mock-example/src/test/resources/xml/BBMO/SrvUpdateClientReferenceDataRq/rq1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <mq:AsyncHeader xmlns:mq="http://sbrf.ru/prpc/mq/headers">
         <mq:message-id>message-id</mq:message-id>
         <mq:request-time>2014-12-16T17:55:06.410+04:00</mq:request-time>
         <mq:operation-name>SrvUpdateClientReferenceDataRq</mq:operation-name>
      </mq:AsyncHeader>
   </soap:Header>
   <soap:Body>
      <tns:SrvUpdateClientReferenceDataRq xmlns:tns="http://sbrf.ru/prpc/bbmo/10">
         <tns:UpdateType>1</tns:UpdateType>
         <tns:ChangeType>1</tns:ChangeType>
         <!--optional--><tns:ChangeSubject>string</tns:ChangeSubject>
         <!--optional--><tns:VSPCommissionPayment>0</tns:VSPCommissionPayment>
         <tns:ClientReferenceData><!--optional--><tns:ClientInformation>
               <tns:Identifiers>
                  <tns:ClientId>1234567890</tns:ClientId>
                  <tns:State>1</tns:State>
                  <tns:CreateDate>2015-02-04</tns:CreateDate>
                  <!--optional--><tns:CloseDate>2015-02-04</tns:CloseDate>
               </tns:Identifiers>
               <tns:SpecialData>
                  <tns:ClientType>1</tns:ClientType>
                  <!--optional--><tns:Resident>0</tns:Resident>
                  <!--optional--><tns:Risk>0</tns:Risk>
                  <!--optional--><tns:RiskExplanation>string</tns:RiskExplanation>
                  <!--optional--><tns:CountryOfRegistration>str</tns:CountryOfRegistration>
                  <!--optional--><tns:CountryOfAccreditation>str</tns:CountryOfAccreditation>
                  <!--optional--><tns:RepresentedInCountry>str</tns:RepresentedInCountry>
                  <!--optional--><tns:AuthorizedCapital>1234567890</tns:AuthorizedCapital>
               </tns:SpecialData>
               <tns:MainDetails>
                  <tns:Registration><!--optional--><tns:OGRN>string</tns:OGRN>
                     <!--optional--><tns:OGRNAssignDate>2015-02-04</tns:OGRNAssignDate>
                     <!--optional--><tns:OGRNIssueDate>2015-02-04</tns:OGRNIssueDate>
                     <tns:ShortName>string</tns:ShortName>
                     <tns:FullName>string</tns:FullName>
                     <!--optional--><tns:ShortNameInEnglish>string</tns:ShortNameInEnglish>
                     <!--optional--><tns:FullNameInEnglish>string</tns:FullNameInEnglish>
                     <!--optional--><tns:RegistrationSertificateNumber>string</tns:RegistrationSertificateNumber>
                     <!--optional--><tns:RegistrationSertificateIssueDate>2015-02-04</tns:RegistrationSertificateIssueDate>
                     <!--optional--><tns:RegistrationAuthority>1234567890</tns:RegistrationAuthority>
                  </tns:Registration>
                  <!--optional--><tns:TaxInspectorateInfo><!--optional--><tns:RegistrationSertificateNumber>string</tns:RegistrationSertificateNumber>
                     <!--optional--><tns:TaxId>string</tns:TaxId>
                     <!--optional--><tns:TaxRegReasonCode>string</tns:TaxRegReasonCode>
                     <!--optional--><tns:KIO>string</tns:KIO>
                     <!--optional--><tns:TaxInspectorate>1234567890</tns:TaxInspectorate>
                     <!--optional--><tns:RegistrationDate>2015-02-04</tns:RegistrationDate>
                  </tns:TaxInspectorateInfo>
                  <!--optional--><tns:RosstatCodes><!--optional--><tns:OKATO>string</tns:OKATO>
                     <!--optional--><tns:OKPO>string</tns:OKPO>
                     <!--optional--><tns:OKFS>st</tns:OKFS>
                     <!--optional--><tns:OKOGU>strin</tns:OKOGU>
                     <!--from 0 to unbounded elements --><tns:OKONH>strin</tns:OKONH>
                     <!--optional--><tns:OKOPF>st</tns:OKOPF>
                     <!--from 0 to unbounded elements --><tns:OKVED>strin</tns:OKVED>
                  </tns:RosstatCodes>
               </tns:MainDetails>
               <!--optional--><tns:BankSubdivision>
                  <tns:TB>str</tns:TB>
                  <tns:OSB>string</tns:OSB>
                  <tns:VSP>string</tns:VSP>
               </tns:BankSubdivision>
               <!--from 0 to unbounded elements --><tns:ClientAddress>
                  <tns:AddressType>1</tns:AddressType>
                  <!--optional--><tns:UnnormalizedAddress>string</tns:UnnormalizedAddress>
                  <!--optional--><tns:Country>str</tns:Country>
                  <!--optional--><tns:PostalCode>string</tns:PostalCode>
                  <!--optional--><tns:IdentificationCode>string</tns:IdentificationCode>
                  <!--optional--><tns:OKATO>string</tns:OKATO>
                  <!--optional--><tns:RegionType>string</tns:RegionType>
                  <!--optional--><tns:Region>string</tns:Region>
                  <!--optional--><tns:AreaType>string</tns:AreaType>
                  <!--optional--><tns:Area>string</tns:Area>
                  <!--optional--><tns:CityType>string</tns:CityType>
                  <!--optional--><tns:City>string</tns:City>
                  <!--optional--><tns:PlaceType>string</tns:PlaceType>
                  <!--optional--><tns:Place>string</tns:Place>
                  <!--optional--><tns:StreetType>string</tns:StreetType>
                  <!--optional--><tns:Street>string</tns:Street>
                  <!--optional--><tns:House>string</tns:House>
                  <!--optional--><tns:Corpus>string</tns:Corpus>
                  <!--optional--><tns:Building>string</tns:Building>
                  <!--optional--><tns:FlatorOffice>string</tns:FlatorOffice>
               </tns:ClientAddress>
               <!--from 0 to unbounded elements --><tns:ClientContact>
                  <tns:ContactCategory>1</tns:ContactCategory>
                  <!--optional--><tns:ContactType>1</tns:ContactType>
                  <!--optional--><tns:ContactName>string</tns:ContactName>
                  <tns:ContactData>string</tns:ContactData>
               </tns:ClientContact>
            </tns:ClientInformation>
            <!--from 0 to unbounded elements --><tns:NaturalPerson>
               <tns:RKOCode>1234567890</tns:RKOCode>
               <tns:RelationToClient>1</tns:RelationToClient>
               <tns:LastName>string</tns:LastName>
               <tns:FirstName>string</tns:FirstName>
               <!--optional--><tns:MiddleName>string</tns:MiddleName>
               <tns:LastNameInGenitiveCase>string</tns:LastNameInGenitiveCase>
               <tns:FirstNameInGenitiveCase>string</tns:FirstNameInGenitiveCase>
               <!--optional--><tns:MiddleNameInGenitiveCase>string</tns:MiddleNameInGenitiveCase>
               <tns:LastNameInEnglish>string</tns:LastNameInEnglish>
               <tns:FirstNameInEnglish>string</tns:FirstNameInEnglish>
               <!--optional--><tns:MiddleNameInEnglish>string</tns:MiddleNameInEnglish>
               <!--optional--><tns:Sex>1</tns:Sex>
               <!--optional--><tns:BirthDate>2015-02-04</tns:BirthDate>
               <!--optional--><tns:BirthPlace>string</tns:BirthPlace>
               <!--optional--><tns:Nationality>str</tns:Nationality>
               <tns:Resident>0</tns:Resident>
               <!--optional--><tns:TaxResidentChangeDate>2015-02-04</tns:TaxResidentChangeDate>
               <!--optional--><tns:TaxId>string</tns:TaxId>
               <!--from 1 to unbounded elements --><tns:IdentityDocument>
                  <tns:DocumentType>1234567890</tns:DocumentType>
                  <tns:DocumentStatus>1</tns:DocumentStatus>
                  <!--optional--><tns:DocumentSeries>string</tns:DocumentSeries>
                  <tns:DocumentNumber>string</tns:DocumentNumber>
                  <!--optional--><tns:IssueDate>2015-02-04</tns:IssueDate>
                  <!--optional--><tns:IssueAuthority>string</tns:IssueAuthority>
                  <!--optional--><tns:IssueAuthorityCode>string</tns:IssueAuthorityCode>
                  <!--optional--><tns:ExpirationDate>2015-02-04</tns:ExpirationDate>
               </tns:IdentityDocument>
               <!--from 0 to unbounded elements --><tns:ClientAddress>
                  <tns:AddressType>1</tns:AddressType>
                  <!--optional--><tns:UnnormalizedAddress>string</tns:UnnormalizedAddress>
                  <!--optional--><tns:Country>str</tns:Country>
                  <!--optional--><tns:PostalCode>string</tns:PostalCode>
                  <!--optional--><tns:IdentificationCode>string</tns:IdentificationCode>
                  <!--optional--><tns:OKATO>string</tns:OKATO>
                  <!--optional--><tns:RegionType>string</tns:RegionType>
                  <!--optional--><tns:Region>string</tns:Region>
                  <!--optional--><tns:AreaType>string</tns:AreaType>
                  <!--optional--><tns:Area>string</tns:Area>
                  <!--optional--><tns:CityType>string</tns:CityType>
                  <!--optional--><tns:City>string</tns:City>
                  <!--optional--><tns:PlaceType>string</tns:PlaceType>
                  <!--optional--><tns:Place>string</tns:Place>
                  <!--optional--><tns:StreetType>string</tns:StreetType>
                  <!--optional--><tns:Street>string</tns:Street>
                  <!--optional--><tns:House>string</tns:House>
                  <!--optional--><tns:Corpus>string</tns:Corpus>
                  <!--optional--><tns:Building>string</tns:Building>
                  <!--optional--><tns:FlatorOffice>string</tns:FlatorOffice>
               </tns:ClientAddress>
               <!--from 0 to unbounded elements --><tns:ClientContact>
                  <tns:ContactCategory>1</tns:ContactCategory>
                  <!--optional--><tns:ContactType>1</tns:ContactType>
                  <!--optional--><tns:ContactName>string</tns:ContactName>
                  <tns:ContactData>string</tns:ContactData>
               </tns:ClientContact>
               <!--optional--><tns:AuthorityBase><!--optional--><tns:DocumentActAuthority>string</tns:DocumentActAuthority>
                  <!--optional--><tns:DocumentSeriesNumber>string</tns:DocumentSeriesNumber>
                  <!--optional--><tns:DocumentDate>2015-02-04</tns:DocumentDate>
               </tns:AuthorityBase>
            </tns:NaturalPerson>
            <!--from 0 to unbounded elements --><tns:LegalPersonBankAccountAgreement>
               <tns:BankSubdivision>
                  <tns:TB>str</tns:TB>
                  <tns:OSB>string</tns:OSB>
                  <tns:VSP>string</tns:VSP>
               </tns:BankSubdivision>
               <tns:ClientId>1234567890</tns:ClientId>
               <!--optional--><tns:AgreementIdentifier>string</tns:AgreementIdentifier>
               <!--optional--><tns:AgreementNumber>string</tns:AgreementNumber>
               <tns:AgreementType>1234567890</tns:AgreementType>
               <tns:AgreementStatus>1</tns:AgreementStatus>
               <tns:AgreementIssueDate>2015-02-04</tns:AgreementIssueDate>
               <!--optional--><tns:AgreementCancelDate>2015-02-04</tns:AgreementCancelDate>
               <tns:Operator>1234567890</tns:Operator>
               <tns:MainAccountNumber>string</tns:MainAccountNumber>
               <tns:AccountBalance>1234567890</tns:AccountBalance>
               <!--optional--><tns:FilePresence1>0</tns:FilePresence1>
               <!--optional--><tns:FilePresence2>0</tns:FilePresence2>
               <!--optional--><tns:ArrestByAccountPresence>1</tns:ArrestByAccountPresence>
               <!--optional--><tns:ArrestedSum>1234567890</tns:ArrestedSum>
               <!--optional--><tns:RKOAgreementDetails><!--optional--><tns:PercentCalculationAlgorithm>1234567890</tns:PercentCalculationAlgorithm>
                  <!--optional--><tns:PartialRatedPeriodCalculation>0</tns:PartialRatedPeriodCalculation>
                  <tns:CurrentRatedPeriodCalculation>0</tns:CurrentRatedPeriodCalculation>
                  <!--optional--><tns:OpeningReason>string</tns:OpeningReason>
                  <!--optional--><tns:AccountUserType>string</tns:AccountUserType>
                  <!--optional--><tns:AgreementUserType>string</tns:AgreementUserType>
               </tns:RKOAgreementDetails>
            </tns:LegalPersonBankAccountAgreement>
            <!--from 0 to unbounded elements --><tns:SignPatternCard>
               <tns:ClientId>1234567890</tns:ClientId>
               <tns:BankSubdivision>
                  <tns:TB>str</tns:TB>
                  <tns:OSB>string</tns:OSB>
                  <tns:VSP>string</tns:VSP>
               </tns:BankSubdivision>
               <tns:AgreementNumber>string</tns:AgreementNumber>
               <tns:AccountNumber>string</tns:AccountNumber>
               <tns:CardType>1</tns:CardType>
               <tns:RegistrationDate>2015-02-04</tns:RegistrationDate>
               <!--optional--><tns:ActivationDate>2015-02-04</tns:ActivationDate>
               <!--optional--><tns:CloseDate>2015-02-04</tns:CloseDate>
               <tns:CardRegistartionMethod>1</tns:CardRegistartionMethod>
               <!--from 1 to unbounded elements --><tns:Sign>
                  <tns:RKONaturalPersonCode>1234567890</tns:RKONaturalPersonCode>
                  <tns:SignType>1</tns:SignType>
                  <tns:Position>string</tns:Position>
                  <!--optional--><tns:AuthorityEndDate>2015-02-04</tns:AuthorityEndDate>
               </tns:Sign>
            </tns:SignPatternCard>
         </tns:ClientReferenceData>
      </tns:SrvUpdateClientReferenceDataRq>
   </soap:Body>
</soap:Envelope>
